InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиВПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиВПомощь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/ТипыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ТипыСотрудников</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Родитель_</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родители</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодителиШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники/Ext/ManagerModule.bsl
Процедура СнятьВсехОтветственных(Объект) Экспорт

	Записи = СоздатьНаборЗаписей();
	Записи.Отбор.Объект.Установить(Объект);
	
	Записи.Записать(Истина);

КонецПроцедуры

Функция ЗапросДляОпределенияОтветственного() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОтветственныеСотрудники.Пользователь,
	                      |	ОтветственныеСотрудники.Пользователь.Наименование КАК Наименование,
	                      |	ВЫБОР
	                      |		КОГДА ОтветственныеСотрудники.Объект = &Объект
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Приоритет1,
	                      |	1 КАК Приоритет2,
	                      |	ОтветственныеСотрудники.ТипСотрудника
	                      |ПОМЕСТИТЬ ТипыС
	                      |ИЗ
	                      |	РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |ГДЕ
	                      |	ОтветственныеСотрудники.Объект = &Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ  
	                      |	СотрудникиВПомощь.Пользователь,
	                      |	СотрудникиВПомощь.Пользователь.Наименование,
	                      |	ВЫБОР
	                      |		КОГДА СотрудникиВПомощь.Объект = &Объект
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ,
	                      |	2,
	                      |	СотрудникиВПомощь.ТипСотрудника
	                      |ИЗ
	                      |	РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
	                      |ГДЕ
	                      |	СотрудникиВПомощь.Объект = &Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ 
	                      |	ТипыС.Пользователь КАК Ссылка,
	                      |	ТипыС.Пользователь.Наименование КАК Наименование,
	                      |	ТипыС.ТипСотрудника.Глубина
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		МАКСИМУМ(ТипыСотрудников.Глубина) КАК Глубина
	                      |	ИЗ
	                      |		ТипыС КАК ТипыС
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыСотрудников КАК ТипыСотрудников
	                      |			ПО ТипыС.ТипСотрудника = ТипыСотрудников.Ссылка
	                      |	ГДЕ
	                      |		ВЫРАЗИТЬ(&ТипСотрудника КАК ПланВидовХарактеристик.ТипыСотрудников).Родители ПОДОБНО ТипыСотрудников.РодителиШаблон) КАК ОтвМакс
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыС КАК ТипыС
	                      |		ПО (ТипыС.ТипСотрудника.Глубина = ОтвМакс.Глубина)
	                      |			И (ВЫРАЗИТЬ(&ТипСотрудника КАК ПланВидовХарактеристик.ТипыСотрудников).Родители ПОДОБНО ТипыС.ТипСотрудника.РодителиШаблон)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипыС.Приоритет1,
	                      |	ТипыС.Приоритет2");
	
	Возврат Запрос;

КонецФункции // ()
